In [1]:
import numpy as np
import pandas as pd

In [10]:
#list kullanarak dataframe verisi oluşturabiliriz
# data=[[1,2,3],[4,5,6],[7,8,9]]

# arr=np.array(data)
# arr

# df=pd.DataFrame(arr,index=["1.torba","2.torba","3.torba"],columns=["sari","kirmizi","mavi"])
# df




#dict kullanarak da dataframe verisi oluşturabiliriz

data={"izmir":[33,np.nan,np.nan],"ankara":[30,np.nan,28],"adiyaman":[45,46,47]}
#nan olmasını istediğimiz degerleri np.nan ile nan koyduk

df=pd.DataFrame(data,index=["pzt","sali","crsmb"],columns=["izmir","ankara","adiyaman"])
#ama dikkat et dict içide geçen ifadeleri columns a koyduk index değil
df

       izmir  ankara  adiyaman
pzt     33.0    30.0        45
sali     NaN     NaN        46
crsmb    NaN    28.0        47

In [12]:
#nan olan satırları çıkartmak için dropna kullanırsın
#df i kendisine eşitlemezsen degişiklik kalıcı olmaz

df.dropna()

     izmir  ankara  adiyaman
pzt   33.0    30.0        45

In [13]:
df

       izmir  ankara  adiyaman
pzt     33.0    30.0        45
sali     NaN     NaN        46
crsmb    NaN    28.0        47

In [15]:
#dropna ile nan olan yerleri veriden temizlerken 
#axis=1 yaparsak sütundaki nanları
#axis=0 yaparsak satırdaki nanları temizler

df.dropna(axis=1)
#nan içeren tüm sütunları çıkardı

       adiyaman
pzt          45
sali         46
crsmb        47

In [17]:
df.dropna(axis=0)
#dropna fonksiyonu default olarak axis=0 yani satırlara göre çıkarma işlemi yapar

     izmir  ankara  adiyaman
pzt   33.0    30.0        45

In [31]:
data2={"elbise":[1050,2000,np.nan],"gomlek":[np.nan,200,np.nan],"ayakkabi":[700,600,500]}

list1=["magaza","magaza","magaza"]
list2=["A","B","C"]
zippedList=list(zip(list1,list2))
multiIndex=pd.MultiIndex.from_tuples(zippedList)


df2=pd.DataFrame(data2,index=multiIndex,columns=["elbise","gomlek","ayakkabi"])

df2["canta"]=[np.nan,np.nan,np.nan]
df2

          elbise  gomlek  ayakkabi  canta
magaza A  1050.0     NaN       700    NaN
       B  2000.0   200.0       600    NaN
       C     NaN     NaN       500    NaN

In [33]:
#tüm nan olan satirlari cikarirsak bazen 1 satır icin yüzlerce veriyi silmiş olabiliriz

df2.dropna(axis=1,thresh=2)
#thresh=2 , 2 ve üzeri sayıda nan barındıran axis=1 yani colonları at

          elbise  ayakkabi
magaza A  1050.0       700
       B  2000.0       600
       C     NaN       500

In [38]:
#dataframeleri her nan içerdiğinde atmıyoruz bazen ortalama bi deger de yazabiliriz iclerine
#eger df ye esitlemezsek islem kaydolmaz

df2.fillna(550)


# df2.fillna(20)

          elbise  gomlek  ayakkabi  canta
magaza A  1050.0   550.0       700  550.0
       B  2000.0   200.0       600  550.0
       C   550.0   550.0       500  550.0